Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator.SelectRebarItem Method (String, String, String, String)
 Selects a rebar item in the rebar database with the given grade, size, usage and code.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarItem SelectRebarItem(
	string Grade,
	string Size,
	string Usage,
	string Code
)
Public Shared Function SelectRebarItem (
	Grade As String,
	Size As String,
	Usage As String,
	Code As String
) As RebarItem
Parameters
Grade
Type: System.String
The grade of the rebar item to select.
Size
Type: System.String
The size of the rebar item to select.
Usage
Type: System.String
The usage of the rebar item to select.
Code
Type: System.String
The code of the rebar item to select.
Return Value
Type: RebarItem
The first RebarItem that matches the conditions.
See Also
Reference
RebarItemEnumerator Class
SelectRebarItem Overload
Tekla.Structures.Catalogs Namespace